# Робота с Моделями



# -----   СОЗДАНИЕ   --------------------------------------------------------------------------------------------------------------------------------------------------------------

# создание плюс одной ячейки в модели
MyModel.objects.create(my_column1="my_value1", my_column2="my_value2")


# -----   ФИЛЬТРАЦИЯ   --------------------------------------------------------------------------------------------------------------------------------------------------------------

# фильтрация обьетов модели по зачениюв указаной колонке
MyModel.objects.filter(my_column="value")

# фильтрация обьектов модели по зачениям по указыным двом колонками
MyModel.objects.filter(my_column1="value1").filter(my_column2="my_value2")

# __ обращения во вторую колонку во второй таблице к зачению, которое ссылаеться на первую колонку в первой таблице
MyModel.object.filter(my_column1__my_column2="my_value")
